erp3l.Доработка/src/Documents/ллл_РеестрСогласованийПлатежей/ллл_РеестрСогласованийПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ллл_РеестрСогласованийПлатежей</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ллл_СтатусыРеестровСогласованийплатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоКрайнейДате</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоДатеЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоПланируемойДате</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоПланируемойДатеСдвиг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокументаЗаявкаНаОплату</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокументаЗаявкаНаОплату</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаОплаты</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <comment>По операции строки делятся на Импортные/Российские, предоплата/постоплата.</comment>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоИмпорт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПредоплата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЗаявка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ллл_ПредварительныйЗаказЗаводуИзготовителю</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборКонтрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборСуммы</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l.Доработка/src/InformationRegisters/ллл_РеквизитыКазначействаДляПредварительныхЗаказов/ллл_РеквизитыКазначействаДляПредварительныхЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ллл_РеквизитыКазначействаДляПредварительныхЗаказов</name>
  <resources>
    <name>АгентПоОплате</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АгентПоДоставке</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорАгентаПоОплате</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ОбработаноРуководителемКазначейства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорАгентаПоДоставке</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентНаценкиАгентаПоОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентНаценкиАгентаПоДоставке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСложныйПроцент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КроссДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СуммаАгентуПоОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАгентуПоДоставке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатывалсяНомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КодРС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erp3l.Доработка/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c89cfc05-3d8b-4809-9775-d96b96c1befb">
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7512207c-c53f-4c94-9c6d-70057ef0ebe0">
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be85d9cc-2632-45bb-a18a-01558fe3b7eb">
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8cae29b-ba90-4b79-9584-2f9e9971dd25">
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c5718917-70eb-45ed-8147-7ede09e4567e">
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ad85d-8b38-4c69-800a-a5585af527ea">
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erp3l.Доработка/src/Documents/ллл_РеестрСогласованийПлатежей/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ОтборКонтрагенты.ЗагрузитьЗначения(Объект.ОтборКонтрагенты.Выгрузить().ВыгрузитьКолонку("Контрагент"));
	УсловноеОформлениеСервер();
	
	ПредОтборПоКрайнейДате          = Объект.ОтборПоКрайнейДате;
	ПредОтборПоДатеЗаказа           = Объект.ОтборПоДатеЗаказа;
	ПредОтборПоПланируемойДате      = Объект.ОтборПоПланируемойДате;
	ПредОтборПоПланируемойДатеСдвиг = Объект.ОтборПоПланируемойДатеСдвиг;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьФильтрТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
	//	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	//	МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	//КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлатежиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элементы.Платежи.ТекущиеДанные <> Неопределено Тогда
		Если РежимОтображения = 4 Тогда
			Ссылка = Элементы.Платежи.ТекущиеДанные.ЗаказПоставщику;
		Иначе
			Ссылка = Элементы.Платежи.ТекущиеДанные.Заявка;
		КонецЕсли;
		ПоказатьЗначение(, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСуммеПриИзменении(Элемент)
	
	ВыполнитьЗаполнениеДокументамиДляСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКрайнейДатеПриИзменении(Элемент)
	
	Если Объект.Платежи.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветИзмененияОтбора", ЭтотОбъект, Новый Структура("ИмяОтбораПоДате", "ОтборПоКрайнейДате"));
		ПоказатьВопрос(Оповещение, "Список платежей будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДатеЗаказаПриИзменении(Элемент)
	
	Если Объект.Платежи.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветИзмененияОтбора", ЭтотОбъект, Новый Структура("ИмяОтбораПоДате", "ОтборПоДатеЗаказа"));
		ПоказатьВопрос(Оповещение, "Список платежей будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПланируемойДатеПриИзменении(Элемент)
	
	Если Объект.Платежи.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветИзмененияОтбора", ЭтотОбъект, Новый Структура("ИмяОтбораПоДате", "ОтборПоПланируемойДате"));
		ПоказатьВопрос(Оповещение, "Список платежей будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПланируемойДатеСдвигПриИзменении(Элемент)
	
	Если Объект.Платежи.Количество() > 0 И ЗначениеЗаполнено(Объект.ОтборПоПланируемойДате) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветИзмененияОтбора", ЭтотОбъект, Новый Структура("ИмяОтбораПоДате", "ОтборПоПланируемойДатеСдвиг"));
		ПоказатьВопрос(Оповещение, "Список платежей будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСуммыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Добавление", "ОтборСуммы", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСуммыПередНачаломИзменения(Элемент, Отказ)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Добавление", "ОтборСуммы", Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСуммыПередУдалением(Элемент, Отказ)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Удаление", "ОтборСуммы", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Добавление", "ОтборКонтрагенты", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентыПередНачаломИзменения(Элемент, Отказ)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Добавление", "ОтборКонтрагенты", Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентыПередУдалением(Элемент, Отказ)
	
	ВыполнитьДействиеСоСтрокой(Отказ, Новый Структура("ИмяТаблицы, Удаление", "ОтборКонтрагенты", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПлатежиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьФильтрТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияПриИзменении(Элемент)
	
	УстановитьФильтрТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ллл_Алгоритмы

&НаКлиенте
Процедура УстановитьФильтрТекущейСтраницы()
	
	ЕстьЗаявка = Истина;
	Если РежимОтображения = 4 Тогда
		ЕстьЗаявка = Ложь;
		ЭтоИмпорт = Истина;
		ЭтоПредоплата = Истина;
	ИначеЕсли РежимОтображения = 0 Тогда
		ЭтоИмпорт = Истина;
		ЭтоПредоплата = Истина;
	ИначеЕсли РежимОтображения = 1 Тогда
		ЭтоИмпорт = Истина;
		ЭтоПредоплата = Ложь;
	ИначеЕсли РежимОтображения = 2 Тогда
		ЭтоИмпорт = Ложь;
		ЭтоПредоплата = Истина;
	ИначеЕсли РежимОтображения = 3 Тогда
		ЭтоИмпорт = Ложь;
		ЭтоПредоплата = Ложь;
	КонецЕсли;
	Элементы.ПлатежиВалютаОплаты.Видимость           = ЕстьЗаявка;
	Элементы.ПлатежиВидОперации.Видимость            = ЕстьЗаявка;
	Элементы.ПлатежиСумма.Видимость                  = ЕстьЗаявка;
	Элементы.ПлатежиПланируемаяДатаПлатежа.Видимость = ЕстьЗаявка;
	Элементы.ПлатежиКрайняяДатаПлатежа.Видимость     = ЕстьЗаявка;
	Элементы.ПлатежиЗаказПоставщику.Видимость        = НЕ ЕстьЗаявка;
	Элементы.ПлатежиНомерДокументаЗаявкаНаОплату.Заголовок = ?(ЕстьЗаявка,
			"Номер документа заявка на оплату", "Номер по данным поставщика");
	Элементы.ПлатежиДатаДокументаЗаявкаНаОплату.Заголовок = ?(ЕстьЗаявка,
			"Дата документа заявка на оплату", "Дата по данным поставщика");
	
	Элементы.Платежи.ОтборСтрок = Новый ФиксированнаяСтруктура("ЭтоИмпорт, ЭтоПредоплата, ЕстьЗаявка", ЭтоИмпорт, ЭтоПредоплата, ЕстьЗаявка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументамиДляСогласования(Команда)
	
	ВыполнитьЗаполнениеДокументамиДляСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеДокументамиДляСогласования()
	
	ЗаполнитьДокументамиДляСогласованияНаСервере();
	УстановитьФильтрТекущейСтраницы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументамиДляСогласованияНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ЗаявкаРДС.Ссылка.ПриоритетОплаты КАК Приоритет,
		|	ВыполнениеПроцессовСрезПоследних.Организация КАК Организация,
		|	ЗаявкаРДС.Ссылка.Подразделение КАК Подразделение,
		|	ЗаявкаРДС.Ссылка.ВидОперацииУХ КАК ВидОперации,
		|	ЗаявкаРДС.Ссылка.Контрагент КАК Контрагент,
		|	ЗаявкаРДС.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЗаявкаРДС.Ссылка.Номер КАК НомерДокументаЗаявкаНаОплату,
		|	ЗаявкаРДС.Ссылка.Дата КАК ДатаДокументаЗаявкаНаОплату,
		|	ЗаявкаРДС.Ссылка.СуммаДокумента КАК СуммаДокумента,
		|	ЗаявкаРДС.Ссылка.Валюта КАК ВалютаДокумента,
		|	ЗаявкаРДС.Сумма КАК Сумма,
		|	ЗаявкаРДС.Ссылка.ВалютаОплаты КАК ВалютаОплаты,
		|	ЗаявкаРДС.Ссылка.ЖелательнаяДатаПлатежа КАК ПланируемаяДатаПлатежа,
		|	ЗаявкаРДС.Ссылка.КрайняяДата КАК КрайняяДатаПлатежа,
		|	ЗаявкаРДС.Ссылка.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	НЕ ЗаказПоставщикуДок.Ссылка ЕСТЬ NULL КАК ЭтоПредоплата,
		|	ЕСТЬNULL(ЗаказПоставщикуДок.ХозяйственнаяОперация, ПриобретениеТоваровУслуг.Ссылка.ХозяйственнаяОперация) = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту) КАК ЭтоИмпорт,
		|	ЗаказПоставщикуДок.Ссылка КАК ЗаказПоставщику,
		|	ПриобретениеТоваровУслуг.Ссылка КАК Поступление,
		|	ЗаявкаРДС.Ссылка КАК Заявка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ВыполнениеПроцессов.СрезПоследних(
		|			,
		|			ЭтапПроцесса В
		|					(ВЫБРАТЬ
		|						Т.Значение
		|					ИЗ
		|						Справочник.Л3_КонстантыНетиповыхАлгоритмов.Список КАК Т
		|					ГДЕ
		|						Т.Ссылка.Наименование = ""ЭтапСогласованияПлатежей"")
		|				И СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповУниверсальныхПроцессов.ВОбработке)
		|				И ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК ВыполнениеПроцессовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭкземплярПроцесса КАК ЭкземплярПроцесса
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаРДС
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуДок
		|				ПО ЗаявкаРДС.Ссылка.ДокументОснование = ЗаказПоставщикуДок.Ссылка
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|				ПО ЗаявкаРДС.Ссылка.ДокументОснование = ПриобретениеТоваровУслуг.Ссылка
		|			ПО ЭкземплярПроцесса.КлючевойОбъектПроцесса = ЗаявкаРДС.Ссылка
		|		ПО ВыполнениеПроцессовСрезПоследних.ДокументПроцесса = ЭкземплярПроцесса.Ссылка
		|ГДЕ
		|	НЕ ЕСТЬNULL(ЗаказПоставщикуДок.Ссылка, ПриобретениеТоваровУслуг.Ссылка) ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Приоритет КАК Приоритет,
		|	Т.Организация КАК Организация,
		|	Т.Подразделение КАК Подразделение,
		|	Т.ВидОперации КАК ВидОперации,
		|	Т.Контрагент КАК Контрагент,
		|	Т.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Т.НомерДокументаЗаявкаНаОплату КАК НомерДокументаЗаявкаНаОплату,
		|	Т.ДатаДокументаЗаявкаНаОплату КАК ДатаДокументаЗаявкаНаОплату,
		|	Т.СуммаДокумента КАК СуммаДокумента,
		|	Т.ВалютаДокумента КАК ВалютаДокумента,
		|	Т.Сумма КАК Сумма,
		|	Т.ВалютаОплаты КАК ВалютаОплаты,
		|	Т.ПланируемаяДатаПлатежа КАК ПланируемаяДатаПлатежа,
		|	Т.КрайняяДатаПлатежа КАК КрайняяДатаПлатежа,
		|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	Т.ЭтоПредоплата КАК ЭтоПредоплата,
		|	Т.ЭтоИмпорт КАК ЭтоИмпорт,
		|	Т.ЕстьЗаявка КАК ЕстьЗаявка,
		|	Т.ЗаказПоставщику КАК ЗаказПоставщику,
		|	Т.Поступление КАК Поступление,
		|	Т.Заявка КАК Заявка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ.Приоритет КАК Приоритет,
		|		ВТ.Организация КАК Организация,
		|		ВТ.Подразделение КАК Подразделение,
		|		ВТ.ВидОперации КАК ВидОперации,
		|		ВТ.Контрагент КАК Контрагент,
		|		ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		ВТ.НомерДокументаЗаявкаНаОплату КАК НомерДокументаЗаявкаНаОплату,
		|		ВТ.ДатаДокументаЗаявкаНаОплату КАК ДатаДокументаЗаявкаНаОплату,
		|		ВТ.СуммаДокумента КАК СуммаДокумента,
		|		ВТ.ВалютаДокумента КАК ВалютаДокумента,
		|		ВТ.Сумма КАК Сумма,
		|		ВТ.ВалютаОплаты КАК ВалютаОплаты,
		|		ВТ.ПланируемаяДатаПлатежа КАК ПланируемаяДатаПлатежа,
		|		ВТ.КрайняяДатаПлатежа КАК КрайняяДатаПлатежа,
		|		ВТ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|		ВТ.ЭтоПредоплата КАК ЭтоПредоплата,
		|		ВТ.ЭтоИмпорт КАК ЭтоИмпорт,
		|		ИСТИНА КАК ЕстьЗаявка,
		|		ВТ.ЗаказПоставщику КАК ЗаказПоставщику,
		|		ВТ.Поступление КАК Поступление,
		|		ВТ.Заявка КАК Заявка
		|	ИЗ
		|		ВТ КАК ВТ
		|	ГДЕ
		|		ВТ.КрайняяДатаПлатежа >= &КрайняяДатаПлатежа
		|		И (НЕ &ОграничениеПланируемойДатыУстановлено
		|				ИЛИ ВТ.ПланируемаяДатаПлатежа МЕЖДУ &ПланируемаяДатаНачало И ДОБАВИТЬКДАТЕ(&ПланируемаяДатаНачало, ДЕНЬ, &СдвигИнтервалаОплат))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПредЗаказ.Приоритет,
		|		ПредЗаказ.Организация,
		|		ПредЗаказ.Подразделение,
		|		NULL,
		|		ПредЗаказ.Контрагент,
		|		ПредЗаказ.Договор,
		|		ПредЗаказ.НомерПоДаннымПоставщика,
		|		ПредЗаказ.ДатаПоДаннымПоставщика,
		|		ПредЗаказ.СуммаДокумента,
		|		ПредЗаказ.Валюта,
		|		NULL,
		|		NULL,
		|		NULL,
		|		NULL,
		|		ПредЗаказ.ХозяйственнаяОперация,
		|		ИСТИНА,
		|		ИСТИНА,
		|		ЛОЖЬ,
		|		ПредЗаказ.Ссылка,
		|		NULL,
		|		NULL
		|	ИЗ
		|		Документ.ллл_ПредварительныйЗаказЗаводуИзготовителю КАК ПредЗаказ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ Т.ллл_КодРС КАК ллл_КодРС, МАКСИМУМ(Т.ллл_НомерВерсии) КАК ллл_НомерВерсии ИЗ Документ.ллл_ПредварительныйЗаказЗаводуИзготовителю КАК Т СГРУППИРОВАТЬ ПО ллл_КодРС) КАК НомераВерсий
		|			ПО ПредЗаказ.ллл_НомерВерсии = НомераВерсий.ллл_НомерВерсии
		|				И ПредЗаказ.ллл_КодРС = НомераВерсий.ллл_КодРС
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуДок
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|				ПО (ВТ.ЗаказПоставщику = ЗаказПоставщикуДок.Ссылка)
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаЗаказа
		|				ПО ЗаказПоставщикуДок.Ссылка = ЗаявкаЗаказа.ДокументОснование
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслуг
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаПТУ
		|					ПО ПриобретениеТоваровУслуг.Ссылка = ЗаявкаПТУ.ДокументОснование
		|				ПО ЗаказПоставщикуДок.Ссылка = ПриобретениеТоваровУслуг.ЗаказПоставщику
		|					И (ПриобретениеТоваровУслуг.Ссылка.Проведен)
		|			ПО (ЗаказПоставщикуДок.ДокументОснование = ПредЗаказ.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ллл_РеквизитыКазначействаДляПредварительныхЗаказов КАК ллл_РеквизитыКазначействаДляПредварительныхЗаказов
		|			ПО ПредЗаказ.ллл_КодРС = ллл_РеквизитыКазначействаДляПредварительныхЗаказов.КодРС
		|	ГДЕ
		|		ПредЗаказ.Дата >= &ДатаЗаказа
		|		И ПредЗаказ.Проведен
		|		И ПредЗаказ.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту)
		|		И ВТ.Заявка ЕСТЬ NULL
		|		И ЗаявкаЗаказа.Ссылка ЕСТЬ NULL
		|		И ЗаявкаПТУ.Ссылка ЕСТЬ NULL
		|		И ЕСТЬNULL(ллл_РеквизитыКазначействаДляПредварительныхЗаказов.ОбработаноРуководителемКазначейства, ЛОЖЬ) = ЛОЖЬ) КАК Т";
	#КонецОбласти
	ТекстОтбора = "";
	РазделительУсловий = "";
	Разделитель = "";
	ШаблонТекста = "Когда Т.ВалютаДокумента = &Вал_%1 Тогда Т.СуммаДокумента >= &Сумма_%1";
	Для Каждого ТекСтр Из Объект.ОтборСуммы Цикл
		Если ЗначениеЗаполнено(ТекСтр.Сумма) И ЗначениеЗаполнено(ТекСтр.Валюта) Тогда
			ТекстОтбора = ТекстОтбора + Разделитель + СтрШаблон(ШаблонТекста, ТекСтр.Валюта.Код);
			Запрос.УстановитьПараметр("Вал_" + ТекСтр.Валюта.Код, ТекСтр.Валюта);
			Запрос.УстановитьПараметр("Сумма_" + ТекСтр.Валюта.Код, ТекСтр.Сумма);
			Разделитель = Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	Если ТекстОтбора <> "" Тогда
		ТекстОтбора = "ВЫБОР " + ТекстОтбора + " ИНАЧЕ ИСТИНА КОНЕЦ";
		РазделительУсловий = Символы.ПС + " И ";
	КонецЕсли;
	Если Объект.ОтборКонтрагенты.Количество() > 0 Тогда
		ТекстОтбора = ТекстОтбора + РазделительУсловий + "Т.Контрагент В (&Контрагенты)";
		Запрос.УстановитьПараметр("Контрагенты", Объект.ОтборКонтрагенты.Выгрузить().ВыгрузитьКолонку("Контрагент"));
	КонецЕсли;
	Запрос.УстановитьПараметр("КрайняяДатаПлатежа", Объект.ОтборПоКрайнейДате);
	Запрос.УстановитьПараметр("ДатаЗаказа", Объект.ОтборПоДатеЗаказа);
	Запрос.УстановитьПараметр("ОграничениеПланируемойДатыУстановлено", ЗначениеЗаполнено(Объект.ОтборПоПланируемойДате));
	Запрос.УстановитьПараметр("ПланируемаяДатаНачало", Объект.ОтборПоПланируемойДате);
	Запрос.УстановитьПараметр("СдвигИнтервалаОплат", Объект.ОтборПоПланируемойДатеСдвиг);
	
	Если ТекстОтбора <> "" Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ" + Символы.ПС + ТекстОтбора;
	КонецЕсли;
	ТЗ = Запрос.Выполнить().Выгрузить();
	Объект.Платежи.Загрузить(ТЗ);
	УсловноеОформлениеСервер();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Объект.Платежи.Выгрузить(, "НомерСтроки, ЭтоПредоплата, ЭтоИмпорт, ЕстьЗаявка"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.НомерСтроки,
		|	Т.ЭтоПредоплата,
		|	Т.ЭтоИмпорт,
		|	Т.ЕстьЗаявка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ ВТ.ЕстьЗаявка
		|			ТОГДА 4
		|		КОГДА ВТ.ЭтоИмпорт
		|				И ВТ.ЭтоПредоплата
		|			ТОГДА 0
		|		КОГДА ВТ.ЭтоИмпорт
		|			ТОГДА 1
		|		КОГДА ВТ.ЭтоПредоплата
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК РежимОтображения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ.НомерСтроки) КАК Количество
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА НЕ ВТ.ЕстьЗаявка
		|			ТОГДА 4
		|		КОГДА ВТ.ЭтоИмпорт
		|				И ВТ.ЭтоПредоплата
		|			ТОГДА 0
		|		КОГДА ВТ.ЭтоИмпорт
		|			ТОГДА 1
		|		КОГДА ВТ.ЭтоПредоплата
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ
		|";
	ТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоОбщее = 0;
	Для Каждого КЗ Из Элементы.РежимОтображения.СписокВыбора Цикл
		Наименование = ?(КЗ.Значение = 0, "Импорт, предоплата",
											?(КЗ.Значение = 1, "Импорт, постоплата",
												?(КЗ.Значение = 2, "Российские, предоплата",
													?(КЗ.Значение = 3, "Российские, постоплата", "Импорт, предоплата (предварительные заказы)"))));
		СтрТЗ = ТЗ.Найти(КЗ.Значение, "РежимОтображения");
		Если СтрТЗ <> Неопределено Тогда
			Наименование = Наименование + " (" + СтрТЗ.Количество + ")";
			КоличествоОбщее = КоличествоОбщее + СтрТЗ.Количество;
		КонецЕсли;
		КЗ.Представление = Наименование;
	КонецЦикла;
	
	КоличествоОтборов = ?(ЗначениеЗаполнено(Объект.ОтборПоКрайнейДате), 1, 0);
	КоличествоОтборов = КоличествоОтборов + ?(Объект.ОтборСуммы.Количество() > 0, 1, 0);
	КоличествоОтборов = КоличествоОтборов + ?(Объект.ОтборКонтрагенты.Количество() > 0, 1, 0);
	Элементы.ГруппаОтборы.Заголовок = "Отборы" + ?(КоличествоОтборов > 0, " (" + КоличествоОтборов + ")", "");
	Элементы.ГруппаДокументы.Заголовок = "Документы" + ?(КоличествоОбщее > 0, " (" + КоличествоОбщее + ")", "");
	Элементы.НадписьПодсказкаКрайнейДаты.Видимость = ЗначениеЗаполнено(Объект.ОтборПоКрайнейДате);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветИзмененияОтбора(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Если ДопПараметры.Свойство("ИмяОтбораПоДате") Тогда
			Объект[ДопПараметры.ИмяОтбораПоДате] = ЭтаФорма["Пред" + ДопПараметры.ИмяОтбораПоДате];
		КонецЕсли;
	Иначе
		Объект.Платежи.Очистить();
		Если ДопПараметры.Свойство("ИмяОтбораПоДате") Тогда
			ЭтаФорма["Пред" + ДопПараметры.ИмяОтбораПоДате] = Объект[ДопПараметры.ИмяОтбораПоДате];
		ИначеЕсли ДопПараметры.Свойство("ИмяТаблицы") Тогда
			Если ДопПараметры.Свойство("Добавление") Тогда
				Если ДопПараметры.Добавление = Истина Тогда
					Элементы[ДопПараметры.ИмяТаблицы].ДобавитьСтроку();
				Иначе
					Элементы[ДопПараметры.ИмяТаблицы].ИзменитьСтроку();
				КонецЕсли;
			ИначеЕсли ДопПараметры.Свойство("Удаление") Тогда
				Объект[ДопПараметры.ИмяТаблицы].Удалить(Элементы[ДопПараметры.ИмяТаблицы].ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
		УсловноеОформлениеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеСоСтрокой(Отказ, ДопПараметры)
	
	Если Объект.Платежи.Количество() > 0 Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветИзмененияОтбора", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, "Список платежей будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
